{"food":[{"geometry":{"location":{"lat":12.911847,"lng":77.638434}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"29242dba01fc551228d2daa973fe38f0c213f9c4","name":"The Punjabi Rasoi","place_id":"ChIJSVVVVZAUrjsRP2egpxIjz5s","types":["restaurant","food","establishment"],"address":"1082,18th Cross,Sector 3,HSR Layout, Bengaluru, Karnataka 560102, India","rating":3,"website":"http://www.thepunjabirasoi.com/","comments":[{"text":"I don't even wanna rate this place as this doesn't even deserve any star. A local dhaba is better than this place in terms of taste quality and service. pathetic place to be , if you wanna waste your money. There are far better places in adjoining areas that is worth. I made a mistake going to PUNJABI RASOI in HSR and will never recommend to anyone. I just hate this place because of the service and food they provided.","sentiment":"positive"},{"text":"Very good food, little more Crowded. So service is little slow obviously. If u r not in hurry u will enjoy. ","sentiment":"positive"},{"text":"Not a great place but you can try out once in a month. Biriyani sucks. Roti and other dishes are quite good.","sentiment":"negative"},{"text":"Service is very very bad. The man sitting at the counter will talk to customers as if they are doing a huge favor by serving food. Abusive.. The staff doesn't deserve even a single star.","sentiment":"negative"},{"text":"its too bad food they served and service persons are dirty and unhygienic","sentiment":"negative"}],"phone_no":null},{"geometry":{"location":{"lat":12.914328,"lng":77.638307}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"933773b1516af4641a6b74da2207913220c28aa5","name":"Kumarakom","place_id":"ChIJ8bynR44UrjsR5SB6ZSgkHQ0","types":["restaurant","food","establishment"],"address":"No-23, 14th Main Road, 4th Sector, Opp BDA Complex, HSR Layout, Bangalore, Karnataka 560102, India","rating":3,"website":"http://www.kumarakomrestaurant.com/","comments":[{"text":"Just finished the lunch here. Thought of updating it before the taste goes. \nThis is one of the worst expensive restaurant where I had food. Food is just ordinary where as the price is extraordinary. Very irresponsible suppliers here who takes order and needs to follow up multiple times to get the ordered items. Will never come here again.","sentiment":"positive"},{"text":"Okay food and will charge you thru the nose. The waiters have the habit of lying to the customers. In my case, I went with the family and my 4yrs daughter asked for chicken lollipop. They've served her with Dragon chicken saying the taste would remain the same and the presentation is just as similar to the lollipop. However, upon receiving the food we realised that neither was the case. Moreover, they did not even bother to give me the complete change (bill was INR 892.00 for 2 meals, one velloory fry which was served as netholi fry and a dragon chicken). They just paid me 100bucks saying 'it is just 8.00Rs Sir'. Well I do not know what class of customer do visit this restaurant...to me that is so damn greedy. I do not mind paying 50 Rs as tips..but only when the restaurant treats me well. Will not suggest this restaurant to anyone. Period!","sentiment":"negative"},{"text":"The Onam Sadya catering  yesterday at Trinity Acres and Woods,Sarjapur Road  was pathetic as the service was sloppy and the payasam was not palatable. The food served in the restaurant is quite amazing. Not expected such an outcome from this restaurant ..","sentiment":"negative"},{"text":"We booked a table at 12.30 but we are getting at 1.30 .. They are giving some stupid reasons for late .. Average kind of kerala food they served ..","sentiment":"positive"},{"text":"Worst food ever eaten in Bangalore. Not just worst Kerala food -- worst any kind of eatery!\nI just can't believe they have won that award from times. Just don't understand the good reviews at all! I just can't put into words how pathetic this place is.\nDecor is good though - I do admit.","sentiment":"positive"}],"phone_no":null},{"geometry":{"location":{"lat":12.91333,"lng":77.651662}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/cafe-71.png","id":"b75bb2a7ce28a911d631b363411c798bd6433ae1","name":"Cafe Coffee Day","place_id":"ChIJzR5NQYcUrjsRMktCg7QJaSM","types":["cafe","food","establishment"],"address":"27th Main Road, Sector 1, HSR Layout, Bengaluru, Karnataka 560102, India","rating":3.8,"website":"http://www.cafecoffeeday.com/","comments":[{"text":"My husband loves coffee here","sentiment":"positive"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"}],"phone_no":null},{"geometry":{"location":{"lat":12.911837,"lng":77.651237}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"272dbd383de6281faadcfbc4deefe87f243f9078","name":"M. K. Retail","place_id":"ChIJR22bGJ0UrjsRljFNy1kslHQ","types":["grocery_or_supermarket","food","store","establishment"],"address":"No.485, 27th Main, 17th Cross, Near NIFT, HSR Layout, Bengaluru, Karnataka 560102, India","rating":4.2,"website":"http://www.mkretail.com/","comments":[{"text":"Very well organised supermarket with almost every daily needs can be found here. Not only fresh sea food but also there are quite good quality of small electrical products in reasonable price compared online retailer, I see it's the best supermarket in HSR Layout as regarding staff service level.","sentiment":"positive"},{"text":"Some of the stuff I bought at MK ahmed HSR Layout (near BDA complex) was spoilt and when I came to return it, the arrogant sales guy denied and he shouted back at me saying I can do anything I want, but he can't return or exchange it. First you sell spoilt stuff and then you don't take it back. I will make this visible to all over the place and make sure no one buys the defective goods and then face non-sense (at least when I get time). ","sentiment":"positive"},{"text":"This is a very good store for fish. Lot of supply and that too fresh ones.\n\nThough the store is small compared to the big super stores like Total and Big Bazaar, the vegetables and non-veg stock is far superior. \n\nMust visit if you want to get good fish around here.","sentiment":"positive"},{"text":"Indeed","sentiment":"positive"},{"text":"","sentiment":"neutral"}],"phone_no":null},{"geometry":{"location":{"lat":12.908136,"lng":77.647608}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"55ede3b3468718b25f382ef81251ad4e51f2f1cd","name":"Packers And Moveŗs","place_id":"ChIJFzuPpj13AjoRIOu4qi8idLk","types":["food","establishment"],"address":"AGARWAL Packers And Movers PVT LTD, Call.24&7,8050014001,9342311580,TYPE AGARWAL TO 56767, HSR Layout, Bengaluru, Karnataka 560102, India","rating":4.1,"website":"http://www.expert5th.in/packers-and-movers-bangalore","comments":[{"text":"waoooooo","sentiment":"neutral"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"}],"phone_no":null},{"geometry":{"location":{"lat":12.912393,"lng":77.651694}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"fc4fead26e699e29323b57abc269cb35b714b067","name":"The French Loaf","place_id":"ChIJpyrwO50UrjsR6rYB2YKxJ6M","types":["bakery","store","food","establishment"],"address":"2317, Opposite NIFT, 27th Main Road, Sector 1, HSR Layout, Bengaluru, Karnataka 560102, India","rating":3.6,"website":"http://thefrenchloaf.in/","comments":[{"text":"could be better. bread is good","sentiment":"positive"},{"text":"I had ordered a photo cake two days ahead of the delivery date, and made the payment in full. On the day of the pickup, I found that the cake was in the fridge (usually in all other shops the pre-ordered cake is kept outside, as it is freshly baked). Moreover, I wanted \"Happy Birthday (Name of the person)\" to be written, and only \"Happy Birthday\" was written. When I brought this to the manager's notice, he scribbled the name in a different colored icing, and a different colored font to my dismay, spoiling the whole decor. Such poor quality service, while getting the payment in full, is just unacceptable.","sentiment":"positive"},{"text":"worst! worst! worst!  cake i ever had in my life....very costly...no  quality at all .....DONT EVER GO THERE","sentiment":"positive"},{"text":"Staff is not friendly.","sentiment":"negative"},{"text":"Staff is not friendly. ","sentiment":"negative"}],"phone_no":null},{"geometry":{"location":{"lat":12.91598,"lng":77.651419}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"a22e8055d7da3ce9c9729a869372564c5bef8926","name":"Luo Han","place_id":"ChIJn7sDhoQUrjsRqJ_IaUnSDJU","types":["restaurant","food","establishment"],"address":"No. 666, Near Police Station, 27th Main Road, 13th Cross Road, HSR Layout, Sector 1, Bengaluru, Karnataka 560102, India","rating":3.7,"website":null,"comments":[{"text":"Worst .,Never go.. Never ever go..\nNever go to this place at all. Owner is crooked. she doesnot like kids, she may beat them up if they try to play with paper napkins/spoons. if you have kids, sometimes you may be denied entrance as well.\n\ni would never rate good for such pathetic restaurants. these people dont deserve to be in business.\n\njust food  being good doesnot help to be the purpose. i dont even want to see her face after i saw her beating one kid , although kids parents are quiet for being polite to her.","sentiment":"positive"},{"text":"Hated the attitude of of the lady there! Though the place was empty in the afternoon and we walked in with with our baby and stroller, the owner started screaming at us for bringing in a stroller. I think she hates kids... Sad! We walked out. There are better places near who welcome you with a smile.","sentiment":"positive"},{"text":"Great place for Chinese.\nI have here often. \nGood taste.. \nNote :- Veg only available.\n\nThe servers there will have angry face tolerate them. \nThe food cover it up..","sentiment":"positive"},{"text":"Pathetic. Not sure how people have rated it! Not a friendly place and owner is obnoxious. On Saturdays all you get is \"Fried Rice\" as they dont have staff to handle incoming customers. People with kids - AVOID. ","sentiment":"negative"},{"text":"Good food; but expect horrible service. That's right, \"expect\" extremely poor service. The owner lady will yell at you, so do not confront her or you'll ruin your dinner. The waiter acts like his nose will fall off if he smiles and he'll grow a horn on his forehead if he brings food on time, so expect delays. Just go there knowing that you are going to have a good vegetarian Chinese meal. ","sentiment":"positive"}],"phone_no":null}],"healthcare":[{"geometry":{"location":{"lat":12.908162,"lng":77.649284}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"27a239956b0c63ac00bebda225f4c50c399f2427","name":"Apollo Pharmacy","place_id":"ChIJtVWEGJwUrjsRuvkVkZ8D2wo","types":["pharmacy","store","health","establishment"],"address":"HSR Layout, Bengaluru, Karnataka 560102, India","rating":null,"website":"http://www.apollopharmacy.in/","comments":[],"phone_no":null},{"geometry":{"location":{"lat":12.907511,"lng":77.648755}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"c2eefd54188950651058fc6bf3dabad887aeb549","name":"Health Nest","place_id":"ChIJLWT-HZwUrjsRaAqeTMqaORM","types":["hospital","establishment"],"address":"1162, 23rd Main Rd, 24th Cross Rd, HSR layout, Sector 2, Bengaluru, Karnataka 560102, India","rating":null,"website":null,"comments":[],"phone_no":null}],"education":[{"geometry":{"location":{"lat":12.91237,"lng":77.645155}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"9ebfa83e45e381b0797f58512ee2d08d6112d80f","name":"Gnan Srishti School of Excellence","place_id":"ChIJG21z2JoUrjsRw-xf3W5QuW8","types":["school","establishment"],"address":"19th Main, 17th Cross, Sector 1, HSR Layout, Bengaluru, Karnataka 560102, India","rating":4,"website":"http://www.gsshsr.com","comments":[{"text":"I am pretty happy about the school. They take care good care of the children. In terms of safety I would recommend it. They dont advertise much but they go ahead with their task without any fuss. My kid has been going to this school for about 3 years, I am happy that I had put my kid here.","sentiment":"positive"},{"text":"My son is studying in this school for last 1 year and we are happy with the school and teachers. We have decided to continue sending our son to this school. The teachers are good and they take good care of kids. My son is  also happy going to school. The new fees structure has come today and there is 0% hike in fees. I was very much worried about this one thing and now relaxed. ","sentiment":"positive"},{"text":"I visited the school with the objective of seeking information for the admission of my children. The person who attended to me was very professional and provided all the information and answered the queries with no hurry as such. The location, people and the activities the school offers makes this my preferred choice. Next steps to follow..Hope to admissions soon.","sentiment":"positive"},{"text":"Small school but clean school nice basketball court and nice swimming poll","sentiment":"positive"},{"text":"Laksmi narasimha","sentiment":"neutral"}],"phone_no":null},{"geometry":{"location":{"lat":12.916546,"lng":77.641994}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"38408706ef26119ecb4eb3e8b397ab96c07b4d08","name":"Freedom International School","place_id":"ChIJ36UfY48UrjsRi035GodFDMM","types":["school","establishment"],"address":"CA-33, 17C, Sector 4, H S R Layout, Bengaluru, Karnataka 560102, India","rating":null,"website":"http://www.freedom-international.in/","comments":[{"text":"One of the best schools around Koramangala and HSR layout ","sentiment":"positive"},{"text":"Very tough admission form. Need to fill many details. Physician form is mandatory & many questions provided in the application form should be answered. The selection is entirely based on the details provided. Tough challenge to fill it for an entry even into Nursery. I suggest not to have this much complexity to the school management as many of us are very busy & may not be able to perform all those things.","sentiment":"negative"},{"text":"Worst process of admission \n","sentiment":"positive"},{"text":"","sentiment":"neutral"}],"phone_no":null},{"geometry":{"location":{"lat":12.916494,"lng":77.643007}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"2d3ba4bc94f2b398a9cd524cd1d71545c40cad52","name":"National Public School","place_id":"ChIJrWeemoUUrjsR98q9HbNlnVg","types":["school","establishment"],"address":"17th B Main, Hsr Layout, Sector-4, Bengaluru, Karnataka 560102, India","rating":3.8,"website":"http://www.npshsr.com/","comments":[{"text":"What kind of medieval assholes report and suspend a grown adolescent girl for merely talking to a boy.\nWhat do these schools and teachers think.\nThis is the same school that would fine students if they were found speaking in Kannada, their mother tongue and language of the soil.\nBan these idiots and throw them in jail ","sentiment":"positive"},{"text":"It's awesome\n","sentiment":"positive"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"}],"phone_no":null},{"geometry":{"location":{"lat":12.913134,"lng":77.639694}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"f0c627f50da247f0d0ff083a825c97be2aec38f0","name":"Kara4Kids - HSR Layout","place_id":"ChIJdy-j1o8UrjsRiqoVI5OTnL8","types":["school","establishment"],"address":"65 IAS Officer's Colony, 15th Cross, 4th Sector, HSR Layout, Bengaluru, Karnataka 560034, India","rating":null,"website":"http://www.kara.in/","comments":[{"text":"","sentiment":"neutral"}],"phone_no":null},{"geometry":{"location":{"lat":12.912339,"lng":77.638868}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"2364bf252b97fc50dc09aa99ae45a1eef7bbc420","name":"I Play I Learn HSR Layout Preschool and Day Care","place_id":"ChIJL_wI0ZEUrjsRgpLnGws02-Q","types":["school","establishment"],"address":"93, 14th Main Road, Sector 7, HSR Layout, Bengaluru, Karnataka 560102, India","rating":null,"website":"http://www.ipilhsr.com/","comments":[{"text":"","sentiment":"neutral"}],"phone_no":null}]}