{"food":[{"geometry":{"location":{"lat":12.966496,"lng":77.641733}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"db078606af3cdca9eae94016744212cb369ab192","name":"Little Italy","place_id":"ChIJb2HI1hwUrjsRviZvdVITiq4","types":["restaurant","food","establishment"],"address":"2017, Next to Reebok Showroom, 100 Feet Road, HAL 2nd Stage, Indiranagar, Bengaluru, Karnataka 560038, India","rating":4.2,"website":"http://www.littleitaly.in/","comments":[{"text":"Tasty food and lots of different varieties to taste. The ambience is really good. ","sentiment":"positive"},{"text":"the service is good and the staff is polite and prompt. BUT the weekend buffet that we took today was a great disappointment and is  absolutely a rip off.. the pizza and bruschetta were satisfactory, the nachos okay .. the salads, entrees and items for the buffet were neither Italian nor continental. it was mish-mash that no Italian food chef will be proud of. Sorry, to say so. \n\nThe lasagne, served as  cubes  was very bland and had none of the usual vegetables.. in their entire spread there was NO mushrooms, spinach, eggplant, zucchini which are italian vegetables.. The risotto was over-cooked, full of white sauce with no taste whatsoever.. the pastas were so-so, no flavours of olive oil or cheese.. talking of desserts, this was a major disapointment.. the display was dismal- the fruit tray had more 'plastic'' fruit than real fruit.. something chocolate was there but no real Italian dessert..only three items were offered which were not really much in taste.\n\ni feel the weekend brunch is completely overpriced for Rs.649  plus tax and did NOT( justify value for the money at all . The menu (on the website) and al carte show several Italian specialities but the buffet had none of these specialities and very ordinary items starting from the soup to dessert..only one type of white bread and no crispy rolls or other kinds of bread.\n\n I had eaten in this restaurant some four years ago and the food was delicious but now it is of poor quality made with cheap ingredients..will certainly not recommend to others. ","sentiment":"positive"},{"text":"hmm well.. good it was","sentiment":"positive"},{"text":"Sunday brunch ( at around 680/- ) is value for money.\n\nGood selection of Salads; Soup was excellent. Good varieties of Pizzas. Starters (topped-up nachos) was good.\n\nPasta was just so-so. Desserts were excellent. The \"live\" Lebanese roll kind of item was \"different\". I liked it but my family didn't. If you are not the adventurous type, then don't try this.","sentiment":"positive"},{"text":"Heaven for vegetarians. Do book before going, gets pretty crowded on weekends. ","sentiment":"negative"}],"phone_no":null},{"geometry":{"location":{"lat":12.969826,"lng":77.641071}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/cafe-71.png","id":"33366896805f82fb882091998293fe95212e7027","name":"Chaipatty","place_id":"ChIJWTm5ImcUrjsRwFHxJ2VAp5Q","types":["cafe","food","establishment"],"address":"2nd Floor, 772, Between Axis Bank & 12th Main signal, 100 Feet Road, Indira Nagar, Bengaluru, Karnataka 560038, India","rating":4,"website":"http://www.chaipatty.com/","comments":[{"text":"Had a nice lazy Sunday afternoon with friends......The pakodas with a 'cutting chai' is highly recommendable !!!","sentiment":"positive"},{"text":"Funky place, good to sit and hang out with friends on mattresses and low chairs and chat. WiFi available.","sentiment":"positive"},{"text":"This is one of the best and unique activity centers in town, apart from salsa, multiple out of the box activities are conducted here. Basically i made my own tea here and m loving it","sentiment":"positive"},{"text":"Good place to hang around with friends and sip masala tea. A little noisy because its right next to the bus stop.","sentiment":"positive"},{"text":"A truly \"Indian\" cafe!","sentiment":"positive"}],"phone_no":null},{"geometry":{"location":{"lat":12.970354,"lng":77.642885}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"cc8a1ed0da317e98b9006769c4645db7ff5e3b2c","name":"Daddy's Deli","place_id":"ChIJm6AoPagWrjsRpPZKiGd-e74","types":["restaurant","food","establishment"],"address":"#594, 12th Main Road, HAL 2nd Stage, Indiranagar, Bengaluru, Karnataka 560008, India","rating":4.2,"website":"http://www.redforkdeli.com/","comments":[{"text":"We went to Daddy's deli as we wanted to try Parsi food. We ordered our food and beverages. The place seemed decent till everything went wrong with the service. The server didn't communicate the time it would take for the food to be cooked or the beverages made (ice tea took 15 min to prepare). Did I mention the restaurant was empty? Also, the food served was not the item we ordered for. So overall, the service was bad. We made this clear to the waiting staff. \n\nThe waiting staff seemed to take the feedback positively until the owner of the place jumped in. She came to our table all rattled and ready to fight. We were all taken aback by the unprofessionalism of this lady. She didn't want us to address her staff and she stormed into the kitchen. Then we heard some utensils flying around, pretty loud at that. At that moment, we realized we should just pay and leave. It just didn't feel right. We asked the manager to bring the bill so that we can leave. The manager apologized profusely on his owner's behalf  accepting the owner was being rude. \n\nFinally when the owner emerged from the kitchen, the food was placed with a big \"thud\" on the table. It reminded me of the good old hostel days. To add to it all, she made it clear to us that we were rude and that she has been right all along. The owner definitely was ill mannered and I would request her to take courses in anger management, time management, and people skills.","sentiment":"positive"},{"text":"Amazing options of parsi food. Can spend a whole day eating and lazing there.","sentiment":"positive"},{"text":"A good warm place . perfect for a lazy sunday brunch..great ambience. Delicious food and value for money. ","sentiment":"positive"},{"text":"Amazing gourmet food, relaxed environment. Owners clearly are managing it directly and it shows. Not cheap, but reasonable for the level of quality and originality.","sentiment":"positive"},{"text":"Food is yum. The place has a 'home dining' kind of feel. Food also tastes like home food than bulk made restaurant kind.","sentiment":"positive"}],"phone_no":null},{"geometry":{"location":{"lat":12.979234,"lng":77.640591}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/bar-71.png","id":"993d95b875f66921d525e85cf29fdea3dea86379","name":"Toit Brewpub","place_id":"ChIJc0JAFaUWrjsRRXSXJPX7YFo","types":["bar","restaurant","food","establishment"],"address":"298, 100 Feet Road, Near KFC Restaurant, Indira Nagar II Stage, Bengaluru, Karnataka 560038, India","rating":4.4,"website":"http://www.toit.in/","comments":[{"text":"Toit is one of the good micro beer brewing pubs in Bangalore. They have around 6 beer flavours that they brew regularly. The ambiance & decor of the place is good. Service is quick especially for the beers :) Food items are delicious and this is a good place to spend time with friends.\nIt gets pretty crowded on weekends and especially at nights. If you need to book a table make sure that you have made a reservation.","sentiment":"positive"},{"text":"An over hyped Micro Brewery: 1. They cannot handle peak times. Dont be surprised if you wait endlessly slash denied a place. 2. Discriminatory: Two guys together just cant enter in. Looks like you must have female companion. 3. The location is nuisance +located at the noisiest traffic cross. \n+ almost into the oldest residential neighborhood. +No Vehicle Parking. 4. At peak hrs, the place just looks aweful with all too garish crowd around. Result: Avoid Peak times read Weekends by all means if you can.","sentiment":"positive"},{"text":"Awesome food. Awesome atmosphere. Awesome beer. \nA personal favorite is the fish and chips. Crisp. If  you're looking for a great time with friends this would be a great place to spend those minutes.","sentiment":"positive"},{"text":"Woodfired pizza at its best + amazing brews. Irish Red IPA! Namma IPA, made of raagi, (millet) are some of the best.","sentiment":"positive"},{"text":"Good brews, excellent food. A bit cramped, would love some more open space!","sentiment":"positive"}],"phone_no":null},{"geometry":{"location":{"lat":12.978156,"lng":77.640737}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"f22ec6d35e3b55d3c370616ad1fc46bd7478d4a8","name":"Pizza Hut","place_id":"ChIJH_JsC6UWrjsRJtlJnBWFSeA","types":["restaurant","food","establishment"],"address":"100 Ft Rd, Hal 2nd Stage, Hoysala Nagar, Bengaluru, Karnataka 560017, India","rating":3.5,"website":"http://www.pizzahut.co.in/","comments":[{"text":"I ordered for a take away on 20th Wednesday 2014 at 2.00 pm or around this time near Ramamurthy Nagar signal outlet, my order was for \"don't cook on wednesday\", buy one get one free offer, and I ordered for I medium size Chicken Tikka and Kadai chicken of same size, I reached the outlet and took the pizzas without verifying them as I believed these guys, after taking it home we started to eat and then realized that it was not chicken it was panner instead of chicken, I immediately called and spoke to the call center who connected me to the outlut where I took the pizzas, who then said they would call back, but still now I haven't received a call, I myself called to enquired about my complaint and they are disconnecting my calls and this happened more than once, very poor service and I feel they are cheating with these offers by adding paneer in place of chicken and also the sauce quality was not good in the pizzas I took. ","sentiment":"positive"},{"text":"Had pizzas today with family, after long time. They enjoyed with many more slices and felt worth going this place. The only issue faced, Pizza hut not serving family size pizzas, so end up spending little more money, with medium size ones.","sentiment":"negative"},{"text":"The Pizza Hut Website is a waste... They show a lot of offers, but when you try to place an order you have to bare the ordeal of a poor interface and then the offer never works.\nAnd the worst part - the Call center agents tell that they will arrange a call back and nothing happens.\n\nWhat a waste of opportunity. ","sentiment":"negative"},{"text":"Brilliant! One of the best outlets of pizza hut I have visited. Keep up the good work :-)","sentiment":"positive"},{"text":"Very poor service.. I will never prefer to go any pizza hut...It was most bad experience for me...","sentiment":"negative"}],"phone_no":null},{"geometry":{"location":{"lat":12.971104,"lng":77.641253}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"261e7d79da78d05edb5d2b30d5abe5dabf757219","name":"Touche","place_id":"ChIJ4dbDxqcWrjsRWSDELrAljtM","types":["restaurant","food","establishment"],"address":"762, Third Floor, 100 Feet Road, HAL 2nd Stage, Indiranagar, 560004, India","rating":4.2,"website":null,"comments":[{"text":"In the age where we are lost behind the digital screens, is it a good idea to have a one \nmore screen in the restaurant!!! Going out with family and friends gives an opportunity to come out of our digital lives and this place does not help with that :-)....\n\nAnyways, the touch table concept is good and the probably the place is worth visiting once...\n\nThe food is good, but not something extra-ordinary. The service was very slow and that killed the excitement.\n\nComing to touch screen, did not find it very responsive. There are games for kids, but since the screen is at the table center its not very convenient access to them. The humor section has adult jokes; need to be careful if with kids. Even though one can order through the touch screen, the waiter comes immediately to confirm the order, which is good, since it avoids accidental orders","sentiment":"positive"},{"text":"The idea of a touch menu sounded exciting to us. But the innovative idea does not make up for the horrible food. The service is pretty good. However this place is a big no no for vegetarians. They have recently included an Indian menu. My verdict u can skip this place and go to cream centre located right below this place instead. ","sentiment":"negative"},{"text":"Out of the world experience at very very reasonable price. Excellent food, great varieties, good fun on the touch tables.","sentiment":"positive"},{"text":"the whole experience was good... a bit pricey though... touch screen is quite responsive... tasty food","sentiment":"positive"},{"text":"Revolutionary concept great food and ambience","sentiment":"positive"}],"phone_no":null},{"geometry":{"location":{"lat":12.979827,"lng":77.639558}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"82921bc8cac58260e90fa0b4b396bab7d9a78411","name":"Imli","place_id":"ChIJa3qMJqUWrjsRy2v8gJNOStA","types":["restaurant","cafe","food","establishment"],"address":"204, 5th Main, 7th Cross, Indiranagar I Stage, Bengaluru, Karnataka 560038, India","rating":4.5,"website":"http://www.imli.co.in/","comments":[{"text":"Absolutely a North Indian veggies delight. Can't think of any place else which comes as close to this for north Indian cuisine. Ambiance is super good especially in the first floor with its roof top and openness. The food is the equally good ranging from starters(the pakodas are irresistible) to main course items to desserts. Not to be missed ever and a must visit place.","sentiment":"positive"},{"text":"Couple  of waiters are very  arrogant. With that you can only turnaway  customers. Avoid","sentiment":"positive"},{"text":"Good, homely food. Soft chapatis, gravies with less oil. Try out their combo meal - phulkas with two curries and dal. \n\nThey have dining at the rooftop, a room below and a small area outside. Old Hindi Melodies keep you good company. The location - near Indiranagar Metro Station - makes it a good place for combining with a metro trip. \n\nA meal for two would be around 500-600. \n\n","sentiment":"positive"},{"text":"Great ambience...true to name lot of tangy stuff...wud love to get back soon....there chat items are awesome","sentiment":"positive"},{"text":"A place like home. Would like to come again 😊","sentiment":"positive"}],"phone_no":null},{"geometry":{"location":{"lat":12.978625,"lng":77.644025}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"eaf45796517e90eb0abbd1bc62ea1f8361986896","name":"Mast Kalandar","place_id":"ChIJrUqmj6QWrjsRmpm0cWPEBhI","types":["restaurant","food","establishment"],"address":"House No 505, 1st Floor, CMH Road, Near M K Retail Building, Indiranagar, Bengaluru, Karnataka 560038, India","rating":3.2,"website":"http://www.mastkalandar.com/","comments":[{"text":"Considering I've practically had just about every lunch and dinner for the last 3 years at this place, I hate to report this review. Hands down this place has the best Dal Makhni and Gulab Jamun in all Bangalore, but the hygiene of Mast Kalandar (or may be just this outlet) is questionable. There were stray incidences of human hair in the bread and stones in the khichdi, but now things have escalated to a totally different level. 2 Weeks back, I reported on MK's facebook page about a big plastic piece in the raita delivered along with Rajma Chawal combo. Today, I had to leave my meal and walk out of the store because of a nicely cooked baby-ROACH in the same Raita. I love the food, love the service and know most of the boys on first name basis, but this THIS is not acceptable. MK's management need to wake up now and get their act together. One bad review (refer Lemp Brewpub's epic) can do such damage to your name that no brand makeover may help you recover.","sentiment":"positive"},{"text":"I loved \"Parathe waali gali\". They have nice collection of their home made pickles. Nice place to eat if you like north Indian vegetarian food.","sentiment":"positive"},{"text":"I don't think I have come across such an expensive food which tastes mediocre. Even if you are pure veg, spare yourself from this god awful place which wants to just loot your money.\n\nTheir home delivery is one of the worst. I had ordered from here with a gap of at least 8 months and every single time there's some issue with the delivery process and you end-up getting much delayed cold food. At this point you'd have lost all the appetite! One of the common defects is they write wrong phone number on your order, so the delivery boy either delivers to someone else or misses out on calling you altogether.\n","sentiment":"negative"},{"text":"I never really go to Mast Kalandar to eat food, but always go for their home delivery option. They have a tie up/ integration with just eat, which makes online ordering very easy. They serve on time, and go fair bit of distance to deliver. Never missed an item in delivery, and the packing and service is good. The food is always satisfying when you get it with just a few clicks and no hassle.\nAlso some of their combos are great (Halka Phulka 2), and really love their gulab jamuns.","sentiment":"positive"},{"text":"It's costly n not worth for the money you pay.... I had to wait 40 mins for ordered food.:/ ","sentiment":"negative"}],"phone_no":null},{"geometry":{"location":{"lat":12.979867,"lng":77.646559}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"8740e978060e573f373a25adbc159f46f7816727","name":"Maia Beacon","place_id":"ChIJE1GfFa4WrjsRoshgQboFDyk","types":["restaurant","food","establishment"],"address":"872/A, HAL 2nd Stage 80 feet Road Indiranagar, Near Spana Book House, Bangalore - 560044, Karnataka, India","rating":null,"website":"http://www.beaconhotels.com/","comments":[{"text":"This is not a hotel so a comparison with a five or four star hotel would be unfair. As a service apartment I would give this a top rating for the value you get for the money. I came here on a business trip and stayed here when my company guest house was over booked. I liked the place so chose to stay here again when I was passing through Bangalore with my family. \n\nThe rooms are spacious, with nice amenities like a small kitchenette, microwave and refrigerator. A neatly tucked away aqua-guard provides you purified drinking water through the day. The Kitchenette is stocked with tea and coffee sachets, but in case you want to do more you could walk down to nearby grocery to pick up stuff to cook. It is stocked with the basic cutlery and utensils for you to cook and eat a small meal. The rooms and bathrooms are well maintained and kept clean. The linens are fresh like you would expect in a top star hotel. \n\nRoom service for food is limited to certain times of the day. I found them responsive to a couple of calls that i gave. Dinner menu is limited and you need to preorder. They need 45 mins to serve from the time you order. I would rate the food basic but homely and well prepared. I liked the meal the first time so chose to dine in-house the second time I visited with my family. \n\n The rooms have free Wifi though i'd believe the speeds could get a bit slow at times. \n\nYou The location is close to Old madras road and walking distance from the metro. The apartment is on the main road and has limited parking space available though the security did give me the impression that there was more parking space available behind the building. There are no garden or spaces that you can walk around, so keep your expectations low on what you can expect as a campus. This is just one vertical building which is nice and cosy once you get in.\n\nOverall - great value for money in case you are just looking for good place to stay for a night.","sentiment":"positive"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"},{"text":"Super j l conseil a tout ceux qui vont a bangalore...bakwaba.club.fr. Bernard de toulouse","sentiment":"neutral"}],"phone_no":null},{"geometry":{"location":{"lat":12.97929,"lng":77.642119}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"32c48e78188ed0fd89712a37753cbc907ff2e64c","name":"Sue's Food Place","place_id":"ChIJ8xyDiq8WrjsRK6HYA5AgWXY","types":["restaurant","food","establishment"],"address":"4, Shri Krishna Temple Road, Indira Nagar II Stage, Bengaluru, Karnataka 560038, India","rating":3.9,"website":null,"comments":[{"text":"A lovely place(and perhaps the only one of its kind in Bangalore) to eat real Caribbean food. The place has a western look with calm Caribbean music and peaceful home like environment with rooms having   tables placed like a home food eatery setup. Its hardcore nonveg so if your definition of nonveg is just chicken, then this might not be for you. Plus you get the friendly warm welcome from the courteous staff and,\n- Sue aunty if you are lucky who is more than happy to give you details about the food served.\nYou cannot compare this place to a hotel as its quite homely and managed by Sue who is originally from Trinidad and Tobago and is someone who driven by passion rather than business. A truly pleasant experience. I love this place !!","sentiment":"positive"},{"text":"very nice homely food.. with fantastic flavours","sentiment":"positive"},{"text":"Great place for lovers of meat. Also the only place where I put aside my religious considerations and have veggie food (that doesn't happen often folks!). The buffets are of the eat-till-you-drop variety, so be prepared to bring an appetite.","sentiment":"negative"},{"text":"Loved the buffet","sentiment":"positive"},{"text":"Read nice reviews about this place and checked it out one day for dinner with my wife (veg) - Didnt like it that much. Mostly non-veg food. Also, found this place to be a little drab and dingy. have heard they have great buffet lunch.","sentiment":"negative"}],"phone_no":null},{"geometry":{"location":{"lat":12.979306,"lng":77.644904}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"bcf0874d0a463a624e7735596ec154101220847a","name":"CakeWalk","place_id":"ChIJy_9yFaUWrjsRAHepIeWxcXo","types":["bakery","store","food","establishment"],"address":"754, Off 100 Feet Road, Shri Krishna Temple Road, 1st Stage, Indira Nagar, Bengaluru, Karnataka 560038, India","rating":4.3,"website":"http://cakewalk.co.in/","comments":[{"text":"best chocolate truffle cake u can get in bangalore","sentiment":"positive"},{"text":"one of the best cake in Bangalore","sentiment":"positive"},{"text":"They gave me a business card in which the contact numbers of Indiranagar branch is printed with Koramangala branch's contact and viceversa. I ordered the cake for Indiranagar but later realized that their card was printed wrong and have to travel all the way back to Koramangala in traffic for my order. Even though Its their mistake they hesitated to even ask an apologize for the inconvenience they caused to me. they are very rude, French people are better than this guys.","sentiment":"positive"},{"text":"Best cakes I've had in Bangalore.","sentiment":"positive"},{"text":"Good","sentiment":"positive"}],"phone_no":null},{"geometry":{"location":{"lat":12.978121,"lng":77.63647}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"562ce7d94400dc9a44a2f8854e851762e18692ad","name":"Raaga The Restaurant","place_id":"ChIJOzNDfqMWrjsRYqJwQbl6HNU","types":["restaurant","food","establishment"],"address":"No. 3, CMH Road, Near HDFC Bank, Indiranagar, Bengaluru, Karnataka 560038, India","rating":3.4,"website":"http://www.raagarestaurant.in/","comments":[{"text":"Good tast & good service...","sentiment":"positive"},{"text":"Very nice cozy restaurant with a lot of variety and tasty food","sentiment":"positive"},{"text":"Ggg","sentiment":"neutral"},{"text":"Average Ambience, Average food taste but expensive pricing.","sentiment":"negative"},{"text":"Rates of daily buffet to be reduced by 15%","sentiment":"negative"}],"phone_no":null},{"geometry":{"location":{"lat":12.968736,"lng":77.649535}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"6c572e35615e9aef456e94e93a89b97f80a923fa","name":"Mast Kalandar","place_id":"ChIJ3XBXQgAUrjsREGIAn-G_NCc","types":["restaurant","food","establishment"],"address":"1657, First Floor, Jeevan Bima Nagar Main Road, HAL 3rd Stage, Bengaluru, Karnataka 560075, India","rating":3.5,"website":"http://mastkalandar.com","comments":[{"text":"The quality of food is good,hospitality and serving is also good, just ordered Home delivery, waiting for 45 minutes so i think they should be able to deliver within 2kms radius in 20minutes,,,and 45 minutes is too much i guess, ","sentiment":"positive"},{"text":"I used to like the Mast Kalandar as a brand but since last 2 times having ordering something and getting something else in return has spoiled the taste for this place.Not recommended until they work on their service.","sentiment":"positive"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"},{"text":"","sentiment":"neutral"}],"phone_no":null},{"geometry":{"location":{"lat":12.964295,"lng":77.641825}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"a0cfdf48868ec3a5a559ab3b8cc43049f5f1f411","name":"Copper Chimney","place_id":"ChIJ6fclrBwUrjsRe94vFchNggU","types":["restaurant","food","establishment"],"address":"Plot No. 2006, 100 Ft Road, Indira Nagar, HAL 2nd Stage, Bengaluru, Karnataka 560038, India","rating":3.6,"website":"http://www.copperchimney.in/","comments":[{"text":"Just another average fancy Indian restaurant.\nThey do not bring anything new to the tables. Same old tikkas, kebabs and nans.\nPlan for some team lunches here. ","sentiment":"negative"},{"text":"I had a great dinner at copper Chimney. The dishes are so delicious and the service is excellent. Nice ambiance too!","sentiment":"positive"},{"text":"Average fancy Indian restaurant... Nothing new on the table. ","sentiment":"negative"},{"text":"Food and menu selection was good.  But, they are not able to handle big groups.  The service was very poor and needs to be improved.","sentiment":"negative"},{"text":"Apart from tandoori and biryani everything else is not worth having. Above all they are super expensive","sentiment":"negative"}],"phone_no":null},{"geometry":{"location":{"lat":12.975467,"lng":77.641211}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/restaurant-71.png","id":"54721231809de35cfb70ee2d2a23609c1a130b3c","name":"Take 5","place_id":"ChIJVVVV0ZA9rjsR_AjoJuecXWM","types":["restaurant","food","establishment"],"address":"54, 2nd Floor, MSK Plaza, 100th Feet Rd, Indira Nagar, Bengaluru, Karnataka 560038, India","rating":4.2,"website":null,"comments":[{"text":"Nice cozy spot! Super karoake nights and live music nights!! always buzzing on thursdays and Saturdays!! Acoustic nights on wednesdays if you like easy listening and a great great place to meet new freinds as the music and drinks are just right with some great food on the menu! Bar tenders are polite and ask for SUNNY, he'll make you feel at home right away! I'd say this place ought to be your cozy watering hole if you live in the vicinity! ","sentiment":"positive"},{"text":"Excellent ambience. Great shows lined up each day. Watch out for Monday Night Open Mic Comedy. ","sentiment":"positive"},{"text":"i luv dis place..widot sunny take5. is nt alive.. ","sentiment":"positive"},{"text":"decent place for hangout with friends ..although nothing special. ","sentiment":"positive"},{"text":"I enjoyed the food... it was too good especially the roast chilly pork.. nice place nice food..","sentiment":"positive"}],"phone_no":null}],"healthcare":[{"geometry":{"location":{"lat":12.965409,"lng":77.641671}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/fitness-71.png","id":"077db5d751faa6e5d9e5c9ae1c2c0aec03ea7f68","name":"Ben Body Studio","place_id":"ChIJR2CWyRwUrjsReyZSwvBwDco","types":["gym","health","establishment"],"address":"No. 2012, Shreyas Plaza, 100 Feet Road, Indira Nagar, Bengaluru, Karnataka 560038, India","rating":null,"website":"http://www.helios-wellness.com/","comments":[],"phone_no":null},{"geometry":{"location":{"lat":12.978128,"lng":77.639798}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/dentist-71.png","id":"ee4ade2e4cd6a3d05409e34f26c5f07f64036aa8","name":"ALL CARE DENTAL CENTRE","place_id":"ChIJC_TbgqQWrjsRwlmGhlltCHU","types":["dentist","health","establishment"],"address":"198, Manjunath Complex, 1st Floor, CMH Road, Indira Nagar 2nd Stage, Bengaluru, 560038, India","rating":null,"website":null,"comments":[],"phone_no":null}],"education":[{"geometry":{"location":{"lat":12.969564,"lng":77.646795}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"33198ee07376f90a45c13c3322a3668e64aa4037","name":"National Public School","place_id":"ChIJ42WJDAIUrjsRzvgoxNFhiWY","types":["school","establishment"],"address":"12 A Main, HAL II Stage, Bengaluru, Karnataka 560008, India","rating":3.9,"website":"http://www.npsinr.com","comments":[{"text":"there was an accident on 2nd of Dec-2013, in NPS Yelahanka school, some kid took sharp sand tool and threw at my son which cut the eye lid, after tests done with doctor it is a cut to lid but lucky that eye ball is ok. it is very scary the way these guys are running the school. there is no sufficient play area, careless teachers. my question is \"HOW CAN THEY PROVIDE BROKEN, SHARP OBJECTS TO KIDS?\"\ntimely replace of broken and avoid giving sharp objects to kids would have saved my kid from this accident, NPS might be good in academics but common sense, safety in bringing up kids is also very much necessary.","sentiment":"negative"},{"text":"Bad mentality","sentiment":"negative"},{"text":"Best 10 years of my life!!!! ","sentiment":"positive"},{"text":"It is the best school","sentiment":"positive"},{"text":"+1, Best 2 years ever !","sentiment":"positive"}],"phone_no":null},{"geometry":{"location":{"lat":12.96769,"lng":77.641971}},"icon":"http://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png","id":"aea6a84d96e2527f6440da3d82346d4ad9b44641","name":"New Horizon Public School","place_id":"ChIJG_4kNx0UrjsRF51LM3M6V04","types":["school","establishment"],"address":"100 Feet Road, Near Titan Showroom, Indira Nagar, Bengaluru, Karnataka 560008, India","rating":2.7,"website":"http://newhorizonindia.edu/nhps_new/","comments":[{"text":"The people who come out of this school usually have bad manners. Perhaps, this might be the worst school to study in. Many of the students here are bully and moreover, they are extremely selfish. They don't let others to read, they also kill each other for marks and are a whole cunning lot. THEY LOOK DECENT OUTSIDE but they don't show even the slightest courtesy towards others. Marks, marks and marks! They die for it. People from NHPS  (especially X std.) will never become good citizens of our country.\n\nThis is my personal experience. I believe a school must teach humility before teaching them all bullshit. \n\nThank You\n\n","sentiment":"positive"},{"text":"Lot of attitude. As many pointed out, now the admission process is just an eyewash. Real game starts with the wait list auctioning.\nThey will not even talk, make you desperate. So only those who are desperate for admission and willing to pay money, stays back and the school milks them acordingly.\n\nEducation may be good, but they are forcing to start the education itself on wrong note \"Bribe and black money\" even before teaching Letter \"A\". \nWay to go.\n","sentiment":"positive"},{"text":"Worst place to study... Greedy, arrogant, cheap management... Money minded institution.. ethically bad students... Qualified teachers with unqualified skills.. communal partiality by teachers... (most teachers are from AP n KL) Don't join dis college if u want the leftover goodness in u or Ur wards.... \n\nP.S: I passed out of da same college. With a feel as hell.","sentiment":"negative"},{"text":"It's a pretty good school... Has first class marks in the board exams... Very good facilities and the teachers are excellent..I studied there and now even my son studies over there. The fees is also not very expensive as compared to other schools... it will provide ur son or daughter with very good education ...I highly recommend nhps for ur kids ","sentiment":"positive"},{"text":"Awesome","sentiment":"positive"}],"phone_no":null}]}